### Exploration of Data

In [9]:
import pandas as pd
import json

In [10]:
# Load the CSV file into a DataFrame
df = pd.read_csv("mock_data.csv")

In [11]:
df.head()

,id,name,age,salary,hire_date,profile,department,bonus
0,1,Name_103,77.0,60000.0,2018-11-02,"{""address"": ""Street 40, City 29"", ""phone"": ""15...",Marketing,NaN
1,2,Name_436,62.0,50000.0,2024-04-25,"{""address"": ""Street 59, City 19"", ""phone"": ""38...",Marketing,NaN
2,3,Name_861,61.0,60000.0,NaN,"{""address"": ""Street 53, City 31"", ""phone"": ""94...",HR,2646.0
3,4,Name_271,36.0,70000.0,2024-04-20,"{""address"": ""Street 92, City 34"", ""phone"": ""46...",NaN,2470.0
4,5,Name_107,78.0,60000.0,2016-06-16,"{""address"": ""Street 77, City 39"", ""phone"": ""62...",IT,9582.0

In [12]:
# Get a summary of the DataFrame
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20000 entries, 0 to 19999
Data columns (total 8 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   id          20000 non-null  int64
 1   name        20000 non-null  object
 2   age         19000 non-null  float64
 3   salary      13519 non-null  float64
 4   hire_date   17967 non-null  object
 5   profile     17945 non-null  object
 6   department  16003 non-null  object
 7   bonus       17960 non-null  float64
dtypes: float64(3), int64(1), object(4)
memory usage: 1.2+ MB

In [13]:
# Check for missing values
df.isnull().sum()

id               0
name             0
age           1000
salary        6481
hire_date     2033
profile       2055
department    3997
bonus         2040
dtype: int64

In [14]:
# View statistical summary for numeric columns
df.describe(include='all')

,id,name,age,salary,hire_date,profile,department,bonus
count,20000.000000,20000,19000.000000,13519.000000,17967,17945,16003,17960.000000
unique,NaN,999,NaN,NaN,3627,17945,4,NaN
top,NaN,Name_825,NaN,NaN,2020-09-15,"{""address"": ""Street 40, City 29"", ""phone"": ""15...",IT,NaN
freq,NaN,37,NaN,NaN,14,1,4058,NaN
mean,10000.500000,NaN,48.444684,59962.275316,NaN,NaN,NaN,5501.858463
std,5773.647028,NaN,17.892848,8200.588356,NaN,NaN,NaN,2594.160562
min,1.000000,NaN,18.000000,50000.000000,NaN,NaN,NaN,1001.000000
25%,5000.750000,NaN,33.000000,50000.000000,NaN,NaN,NaN,3261.000000
50%,10000.500000,NaN,48.000000,60000.000000,NaN,NaN,NaN,5547.500000
75%,15000.250000,NaN,64.000000,70000.000000,NaN,NaN,NaN,7736.000000
max,20000.000000,NaN,79.000000,70000.000000,NaN,NaN,NaN,10000.000000

In [15]:
# Check unique values in the 'department' column
df['department'].unique()

array(['Marketing', 'HR', nan, 'IT', 'Finance'], dtype=object)

### Data Cleaning

In [16]:
# Fill missing values in 'age' and 'salary' with the median
df['age'].fillna(df['age'].median(), inplace=True)
df['salary'].fillna(df['salary'].median(), inplace=True)

/var/folders/mv/5skqq8p925lbtt_m8d7msnkc0000gn/T/ipykernel_40400/709341248.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['age'].fillna(df['age'].median(), inplace=True)
/var/folders/mv/5skqq8p925lbtt_m8d7msnkc0000gn/T/ipykernel_40400/709341248.py:3: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['salary'].fillna(df['salary'].median(), inplace=True)

In [17]:
# Fill missing values in 'department' with 'Unknown'
df['department'].fillna('Unknown', inplace=True)

/var/folders/mv/5skqq8p925lbtt_m8d7msnkc0000gn/T/ipykernel_40400/4109035021.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['department'].fillna('Unknown', inplace=True)

In [18]:
# Print sample data after handling missing values
print("Sample data after filling missing values:")
print(df.head(), "\n")

Sample data after filling missing values:
   id      name   age   salary   hire_date  \
0   1  Name_103  77.0  60000.0  2018-11-02
1   2  Name_436  62.0  50000.0  2024-04-25
2   3  Name_861  61.0  60000.0         NaN
3   4  Name_271  36.0  70000.0  2024-04-20
4   5  Name_107  78.0  60000.0  2016-06-16

                                             profile department   bonus
0  {"address": "Street 40, City 29", "phone": "15...  Marketing     NaN
1  {"address": "Street 59, City 19", "phone": "38...  Marketing     NaN
2  {"address": "Street 53, City 31", "phone": "94...         HR  2646.0
3  {"address": "Street 92, City 34", "phone": "46...    Unknown  2470.0
4  {"address": "Street 77, City 39", "phone": "62...         IT  9582.0

In [19]:
# Convert 'profile' from JSON string to dictionary
df['profile'] = df['profile'].apply(lambda x: json.loads(x) if pd.notnull(x) else {})

In [20]:
# Print sample data after converting 'profile' column
print("Sample data after converting 'profile' column:")
print(df[['profile']].head(), "\n")

Sample data after converting 'profile' column:
                                             profile
0  {'address': 'Street 40, City 29', 'phone': '15...
1  {'address': 'Street 59, City 19', 'phone': '38...
2  {'address': 'Street 53, City 31', 'phone': '94...
3  {'address': 'Street 92, City 34', 'phone': '46...
4  {'address': 'Street 77, City 39', 'phone': '62...

In [21]:
# Extract 'address', 'phone', and 'email' from 'profile' column
df['address'] = df['profile'].apply(lambda x: x.get('address', None))
df['phone'] = df['profile'].apply(lambda x: x.get('phone', None))
df['email'] = df['profile'].apply(lambda x: x.get('email', None))

In [22]:
# Print sample data after extracting fields from 'profile'
print("Sample data after extracting fields from 'profile':")
print(df[['address', 'phone', 'email']].head(), "\n")

Sample data after extracting fields from 'profile':
              address       phone                  email
0  Street 40, City 29  1506076536   email_15@example.com
1  Street 59, City 19  3852067496  email_951@example.com
2  Street 53, City 31  9440261920  email_627@example.com
3  Street 92, City 34  4600523881  email_107@example.com
4  Street 77, City 39  6297458477   email_16@example.com

In [23]:
# Drop the original 'profile' column
df.drop(columns=['profile'], inplace=True)

In [24]:
# Print sample data after dropping 'profile' column
print("Sample data after dropping 'profile' column:")
print(df.head(), "\n")

Sample data after dropping 'profile' column:
   id      name   age   salary   hire_date department   bonus  \
0   1  Name_103  77.0  60000.0  2018-11-02  Marketing     NaN
1   2  Name_436  62.0  50000.0  2024-04-25  Marketing     NaN
2   3  Name_861  61.0  60000.0         NaN         HR  2646.0
3   4  Name_271  36.0  70000.0  2024-04-20    Unknown  2470.0
4   5  Name_107  78.0  60000.0  2016-06-16         IT  9582.0

              address       phone                  email
0  Street 40, City 29  1506076536   email_15@example.com
1  Street 59, City 19  3852067496  email_951@example.com
2  Street 53, City 31  9440261920  email_627@example.com
3  Street 92, City 34  4600523881  email_107@example.com
4  Street 77, City 39  6297458477   email_16@example.com

In [25]:
# Save the cleaned DataFrame to a new CSV file
df.to_csv("cleaned_data.csv", index=False)

In [26]:
# Confirm data has been saved
print("Cleaned data saved to 'cleaned_data.csv'")

Cleaned data saved to 'cleaned_data.csv'

### Data Transformation

In [28]:
# Add a new column 'address_length' that calculates the length of the address
df['address_length'] = df['address'].apply(lambda x: len(str(x)))

In [29]:
# Print sample data after adding 'address_length' column
print("Sample data after adding 'address_length' column:")
print(df[['address', 'address_length']].head(), "\n")

Sample data after adding 'address_length' column:
              address  address_length
0  Street 40, City 29              18
1  Street 59, City 19              18
2  Street 53, City 31              18
3  Street 92, City 34              18
4  Street 77, City 39              18

In [30]:
# Define the bins and labels
bins = [0, 50000, 70000, 100000]
labels = ['low', 'medium', 'high']

In [31]:
# Create a new column 'salary_category'
df['salary_category'] = pd.cut(df['salary'], bins=bins, labels=labels, include_lowest=True)

In [32]:
# Print sample data after adding 'salary_category' column
print("Sample data after adding 'salary_category' column:")
print(df[['salary', 'salary_category']].head(), "\n")

Sample data after adding 'salary_category' column:
    salary salary_category
0  60000.0          medium
1  50000.0             low
2  60000.0          medium
3  70000.0          medium
4  60000.0          medium

In [33]:
# Group by 'department' and calculate average salary and age
summary_report = df.groupby('department').agg({
    'salary': 'mean',
    'age': 'mean'
}).reset_index()

In [34]:
# Rename columns for clarity
summary_report.columns = ['Department', 'Average Salary', 'Average Age']

In [35]:
# Print the summary report
print("Summary report of average salary and age by department:")
print(summary_report, "\n")

Summary report of average salary and age by department:
  Department  Average Salary  Average Age
0    Finance    59830.035515    48.345256
1         HR    60015.155342    48.620106
2         IT    60034.499754    48.650074
3  Marketing    60049.455984    48.419139
4    Unknown    59939.954966    48.075056

In [36]:
# Save the final transformed DataFrame to a new CSV file
df.to_csv("transformed_data.csv", index=False)

In [37]:
# Confirm data has been saved
print("Final transformed data saved to 'transformed_data.csv'")

Final transformed data saved to 'transformed_data.csv'